Catalogs/фин_НаборыШаблоновОтраженияПервичныхДанныхВБюджетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_НаборыШаблоновОтраженияПервичныхДанныхВБюджетах</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_ВидыДокументов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПримененияШаблона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.усд_УсловияВыполненияОперацийПоДокументам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособИспользования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_СпособИспользованияШаблонаОтраженияВБюджетировании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьШаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Удалить_фин_ШаблоныОтраженияФактическихДанныхПоБюджетам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_СхемыОтраженияФактическихДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/фин_СпособИспользованияШаблонаОтраженияВБюджетировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_СпособИспользованияШаблонаОтраженияВБюджетировании</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всегда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсегдаЕслиУдовлетворяетУсловию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕслиУдовлетворяетУсловию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕслиНеНайденУдовлетворяющийУсловиюШаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_НаборыШаблоновОтраженияПервичныхДанныхВБюджетах/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мВид = Объект.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	фин_РаботаСДиалогамиБюджетирование.ОбработатьВыборВидаДокументаДляОтраженияВБюджетировании(Элемент,СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Если мВид <> Объект.Владелец Тогда
		мВид = Объект.Владелец;
	    Объект.НаборШаблонов.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Владелец.Пустая() Тогда
		ПоказатьПредупреждение(,"Не указан вид документов!",120);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.НаборШаблонов.ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.Всегда");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновСпособИспользованияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НаборШаблонов.ТекущиеДанные;
	Если ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.Всегда")
		ИЛИ ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ЕслиНеНайденУдовлетворяющийУсловиюШаблон") Тогда
		ТекущиеДанные.УсловиеПримененияШаблона = ПредопределенноеЗначение("Справочник.усд_УсловияВыполненияОперацийПоДокументам.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНабораСхемОтражения",Новый Структура("Объект,Наименование",Объект.Ссылка,Объект.Наименование));
КонецПроцедуры
